STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G071B-Discovery/stm32g071b_discovery.c
/**
******************************************************************************
* @file    stm32g071b_discovery.c
* @author  MCD Application Team
* @brief   This file provides a set of firmware functions to manage Leds,
*          push-button and joystick of STM32G071B-DISCO board (MB1378)
******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 STMicroelectronics</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "stm32g071b_discovery.h"

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32G071B-DISCO
  * @brief This file provides firmware functions to manage Leds, push-buttons,
  *        LCD display and power sensors (INA230) available on
  *        STM32G071B-DISCO board from STMicroelectronics.
  * @{
  */

/** @addtogroup STM32G071B_DISCOVERY_Common
  * @{
  */

/** @addtogroup STM32G071B_DISCOVERY_Private_Constants
  * @{
  */

/**
 * @brief STM32G071B DISCOVERY BSP Driver version number
   */
#define __STM32G071B_DISCOVERY_BSP_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define __STM32G071B_DISCOVERY_BSP_VERSION_SUB1   (0x02U) /*!< [23:16] sub1 version */
#define __STM32G071B_DISCOVERY_BSP_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define __STM32G071B_DISCOVERY_BSP_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define __STM32G071B_DISCOVERY_BSP_VERSION            ((__STM32G071B_DISCOVERY_BSP_VERSION_MAIN << 24)\
                                                       |(__STM32G071B_DISCOVERY_BSP_VERSION_SUB1 << 16)\
                                                       |(__STM32G071B_DISCOVERY_BSP_VERSION_SUB2 << 8 )\
                                                       |(__STM32G071B_DISCOVERY_BSP_VERSION_RC))

#if defined(_GUI_INTERFACE)
const uint8_t HWBoardVersionName[] = "STM32G071B-DISCO";
const uint8_t PDTypeName[] = "MB1378B";
#endif /* _GUI_INTERFACE */

/**
  * @}
  */

/** @defgroup STM32G071B_DISCOVERY_Exported_Variables Exported Variables
  * @{
  */

/**
 * @brief ALERT variables
 */
GPIO_TypeDef*   ALERT_PORT[ALERTn] =  {ALERT_VBUS_GPIO_PORT,
                                       ALERT_CC1_GPIO_PORT,
                                       ALERT_CC2_GPIO_PORT};

const uint16_t  ALERT_PIN[ALERTn] =   {ALERT_VBUS_PIN,
                                       ALERT_CC1_PIN,
                                       ALERT_CC2_PIN};

const uint8_t ALERT_IRQn[JOYn] =   {ALERT_VBUS_EXTI_IRQn,
                                    ALERT_CC1_EXTI_IRQn,
                                    ALERT_CC2_EXTI_IRQn};
/**
 * @brief LED variables
 */
GPIO_TypeDef*   LED_PORT[LEDn] =  {LED4_GPIO_PORT,
                                   LED5_GPIO_PORT,
                                   LED6_GPIO_PORT,
                                   LED7_GPIO_PORT};

const uint16_t  LED_PIN[LEDn] =   {LED4_PIN,
                                   LED5_PIN,
                                   LED6_PIN,
                                   LED7_PIN};


/**
 * @brief JOYSTICK variables
 */
 GPIO_TypeDef* JOY_PORT[JOYn] =  {SEL_JOY_GPIO_PORT,
                                  DOWN_JOY_GPIO_PORT,
                                  LEFT_JOY_GPIO_PORT,
                                  RIGHT_JOY_GPIO_PORT,
                                  UP_JOY_GPIO_PORT};

const uint16_t JOY_PIN[JOYn] =   {SEL_JOY_PIN,
                                  LEFT_JOY_PIN,
                                  RIGHT_JOY_PIN,
                                  DOWN_JOY_PIN,
                                  UP_JOY_PIN};

const uint8_t JOY_IRQn[JOYn] =   {SEL_JOY_EXTI_IRQn,
                                  LEFT_JOY_EXTI_IRQn,
                                  RIGHT_JOY_EXTI_IRQn,
                                  DOWN_JOY_EXTI_IRQn,
                                  UP_JOY_EXTI_IRQn};

/**
 * @brief MOSFET variables
 */
GPIO_TypeDef*   MOSFET_PORT[MOSFETn] = {MOSFET_ENCC1_GPIO_PORT,
                                        MOSFET_ENCC2_GPIO_PORT,
                                        MOSFET_RD_CC1_GPIO_PORT};

const uint16_t  MOSFET_PIN[MOSFETn]  =  {MOSFET_ENCC1_PIN,
                                         MOSFET_ENCC2_PIN,
                                         MOSFET_RD_CC1_PIN};

/**
 * @brief BUS variables
 */
#if defined(HAL_I2C_MODULE_ENABLED)
uint32_t I2c1Timeout = DISCOVERY_I2C1_TIMEOUT_MAX;  /*<! Value of Timeout when I2C1 communication fails */
static I2C_HandleTypeDef I2c1Handle;
static uint8_t I2C1RefCounter = 0;
#endif /* HAL_I2C_MODULE_ENABLED */

#if defined(HAL_SPI_MODULE_ENABLED)
uint32_t SpixTimeout = SPIx_TIMEOUT_MAX;            /*<! Value of Timeout when SPI communication fails */
static SPI_HandleTypeDef SpiHandle;
#endif /* HAL_SPI_MODULE_ENABLED */
/**
  * @}
  */

/** @defgroup STM32G071B_DISCOVERY_Private_macros Private macros
  * @{
  */
#if defined(HAL_SPI_MODULE_ENABLED)

/* LL definition */
#define __SPI_DIRECTION_2LINES(__HANDLE__)   do{\
                                             CLEAR_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE);\
                                             }while(0);

#define __SPI_DIRECTION_2LINES_RXONLY(__HANDLE__)   do{\
                                                   CLEAR_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE);\
                                                   SET_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_RXONLY);\
                                                   }while(0);

#define __SPI_DIRECTION_1LINE_TX(__HANDLE__) do{\
                                             CLEAR_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE);\
                                             SET_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE);\
                                             }while(0);

#define __SPI_DIRECTION_1LINE_RX(__HANDLE__) do {\
                                             CLEAR_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE);\
                                             SET_BIT((__HANDLE__)->Instance->CR1, SPI_CR1_BIDIMODE);\
                                             } while(0);
#endif /* HAL_SPI_MODULE_ENABLED */
/**
  * @}
  */

/** @addtogroup STM32G071B_DISCOVERY_BUS_Operations_Functions
  * @{
  */
/**************************** Bus functions ************************************/
/* I2C1 bus function */
#if defined(HAL_I2C_MODULE_ENABLED)
static HAL_StatusTypeDef  I2C1_Init(void);
static void               I2C1_MspInit(I2C_HandleTypeDef *hi2c);
static void               I2C1_DeInit(void);
static void               I2C1_MspDeInit(I2C_HandleTypeDef *hi2c);
static HAL_StatusTypeDef  I2C1_WriteBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static HAL_StatusTypeDef  I2C1_ReadBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static void               I2C1_Error(void);
#endif/* HAL_I2C_MODULE_ENABLED */

/* SPIx bus function */
#if defined(HAL_SPI_MODULE_ENABLED)
static void               SPIx_Init(void);
static void               SPIx_MspInit(SPI_HandleTypeDef *hspi);
static void               SPIx_DeInit(void);
static void               SPIx_MspDeInit(void);
static void               SPIx_Write(uint8_t byte);
#endif
/**
  * @}
  */

/** @defgroup STM32G071B_DISCOVERY_LINK_Operations_Functions LINK Operations Functions
  * @{
  */
/**************************** Link functions ***********************************/
#if defined(HAL_I2C_MODULE_ENABLED)
/* Link functions for Power Monitoring peripheral */
uint8_t                   PWRMON_IO_Init(uint16_t Addr);
void                      PWRMON_IO_DeInit(uint16_t Addr);
uint8_t                   PWRMON_IO_Write(uint16_t Addr, uint8_t Reg, uint8_t * pData);
uint8_t                   PWRMON_IO_Read(uint16_t Addr, uint8_t Reg, uint8_t *pData);
void                      PWRMON_IO_EnableIT(uint16_t Addr, uint8_t ActiveEdge);
void                      PWRMON_IO_DisableIT(uint16_t Addr);
#endif/* HAL_I2C_MODULE_ENABLED */

#if defined(HAL_SPI_MODULE_ENABLED)
/* Link function for LCD peripheral */
void                      LCD_IO_Init(void);
void                      LCD_IO_DeInit(void);
void                      LCD_IO_WriteCommand(uint8_t Cmd);
void                      LCD_IO_WriteData(uint8_t Value);
void                      LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size);
#endif

/**
  * @}
  */

