STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G071B-Discovery/stm32g071b_discovery.c
/** @defgroup STM32G071B_DISCOVERY_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32G071B DISCOVERY BSP Driver revision
  * @retval version 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return __STM32G071B_DISCOVERY_BSP_VERSION;
}

#if defined(_GUI_INTERFACE)
/**
  * @brief  This method returns HW board version name
  * @retval HW Board version name
  */
const uint8_t* BSP_GetHWBoardVersionName(void)
{
  return HWBoardVersionName;
}

/**
  * @brief  This method returns HW PD Type name
  * @retval HW Board version name
  */
const uint8_t* BSP_GetPDTypeName(void)
{
  return PDTypeName;
}
#endif /* _GUI_INTERFACE */

/**
  * @brief  Configures LED GPIOs.
  * @param  Led Specifies the Led to be configured.
  *   This parameter can be one of following parameters:
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  *     @arg LED7
  * @retval None
  */
void BSP_LED_Init(Led_TypeDef Led)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the GPIO_LED clock */
  LEDx_GPIO_CLK_ENABLE(Led);

  /* Configure the GPIO_LED pin */
  GPIO_InitStructure.Pin = LED_PIN[Led];
  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  HAL_GPIO_Init(LED_PORT[Led], &GPIO_InitStructure);

  HAL_GPIO_WritePin(LED_PORT[Led], GPIO_InitStructure.Pin, GPIO_PIN_RESET);
}

/**
  * @brief  Unconfigures LED GPIOs.
  * @param  Led Specifies the Led to be unconfigured.
  *   This parameter can be one of following parameters:
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  *     @arg LED7
  * @retval None
  */
void BSP_LED_DeInit(Led_TypeDef Led)
{
  HAL_GPIO_DeInit(LED_PORT[Led], LED_PIN[Led]);
}

/**
  * @brief  Turns selected LED On.
  * @param  Led Specifies the Led to be set on.
  *   This parameter can be one of following parameters:
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  *     @arg LED7
  * @retval None
  */
void BSP_LED_On(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led Specifies the Led to be set off.
  *   This parameter can be one of following parameters:
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  *     @arg LED7
  * @retval None
  */
void BSP_LED_Off(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led Specifies the Led to be toggled.
  *   This parameter can be one of following parameters:
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  *     @arg LED7
  * @retval None
  */
void BSP_LED_Toggle(Led_TypeDef Led)
{
  HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
}

/**
  * @brief  Configures all buttons of the joystick in GPIO or EXTI modes.
  * @param  Joy_Mode Joystick mode.
  *    This parameter can be one of the following values:
  *     @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *     @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @retval HAL_OK if all initializations are OK. Other value if error.
  */
uint8_t BSP_JOY_Init(JOYMode_TypeDef Joy_Mode)
{
  JOYState_TypeDef joykey;
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Initialized the Joystick. */
  for(joykey = JOY_SEL; joykey < (JOY_SEL + JOYn) ; joykey++)
  {
    /* Enable the JOY clock */
    JOYx_GPIO_CLK_ENABLE(joykey);

    GPIO_InitStruct.Pin = JOY_PIN[joykey];
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    if (Joy_Mode == JOY_MODE_GPIO)
    {
      /* Configure Joy pin as input */
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      HAL_GPIO_Init(JOY_PORT[joykey], &GPIO_InitStruct);
    }
    else if (Joy_Mode == JOY_MODE_EXTI)
    {
      /* Configure Joy pin as input with External interrupt */
      GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
      HAL_GPIO_Init(JOY_PORT[joykey], &GPIO_InitStruct);

      /* Enable and set Joy EXTI Interrupt to the lowest priority */
      HAL_NVIC_SetPriority((IRQn_Type)(JOY_IRQn[joykey]), 0x0F, 0x00);
      HAL_NVIC_EnableIRQ((IRQn_Type)(JOY_IRQn[joykey]));
    }
  }

  return HAL_OK;
}

/**
  * @brief  Unonfigures all GPIOs used as buttons of the joystick.
  * @retval None.
  */
void BSP_JOY_DeInit(void)
{
  JOYState_TypeDef joykey;

  /* Initialized the Joystick. */
  for(joykey = JOY_SEL; joykey < (JOY_SEL + JOYn) ; joykey++)
  {
    HAL_GPIO_DeInit(JOY_PORT[joykey], JOY_PIN[joykey]);
  }
}

/**
* @brief  Returns the current joystick status.
* @retval Code of the joystick key pressed
*          This code can be one of the following values:
*            @arg  JOY_NONE
*            @arg  JOY_SEL
*            @arg  JOY_DOWN
*            @arg  JOY_LEFT
*            @arg  JOY_RIGHT
*            @arg  JOY_UP
*/
JOYState_TypeDef BSP_JOY_GetState(void)
{
  JOYState_TypeDef joykey;

  for (joykey = JOY_SEL; joykey < (JOY_SEL + JOYn) ; joykey++)
  {
    if (HAL_GPIO_ReadPin(JOY_PORT[joykey], JOY_PIN[joykey]) == GPIO_PIN_SET)
    {
      /* Return Code Joystick key pressed */
      return joykey;
    }
  }

  /* No Joystick key pressed */
  return JOY_NONE;
}

/**
  * @brief  Configures MOSFET GPIOs.
  * @param  Mosfet Specifies the Mosfet GPIO to be configured.
  *   This parameter can be one of following parameters:
  *     @arg MOSFET_ENCC1
  *     @arg MOSFET_ENCC2
  *     @arg MOSFET_RD_CC1
  *     @arg MOSFET_RD_CC2
  * @retval None
  */
void BSP_MOSFET_Init(Mosfet_TypeDef Mosfet)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the GPIO_MOSFET clock */
  MOSFETx_GPIO_CLK_ENABLE(Mosfet);

  /* Configure the GPIO_MOSFET pin */
  GPIO_InitStructure.Pin = MOSFET_PIN[Mosfet];
  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  HAL_GPIO_Init(MOSFET_PORT[Mosfet], &GPIO_InitStructure);

  HAL_GPIO_WritePin(MOSFET_PORT[Mosfet], GPIO_InitStructure.Pin, GPIO_PIN_RESET);
}

/**
  * @brief  Unconfigures MOSFET GPIOs.
  * @param  Mosfet Specifies the Mosfet GPIO to be unconfigured.
  *   This parameter can be one of following parameters:
  *     @arg MOSFET_ENCC1
  *     @arg MOSFET_ENCC2
  *     @arg MOSFET_RD_CC1
  *     @arg MOSFET_RD_CC2
  * @retval None
  */
void BSP_MOSFET_DeInit(Mosfet_TypeDef Mosfet)
{
  HAL_GPIO_DeInit(MOSFET_PORT[Mosfet], MOSFET_PIN[Mosfet]);
}

/**
  * @brief  Turns selected MOSFET On.
  * @param  Mosfet Specifies the Mosfet to be set on.
  *   This parameter can be one of following parameters:
  *     @arg MOSFET_ENCC1
  *     @arg MOSFET_ENCC2
  *     @arg MOSFET_RD_CC1
  *     @arg MOSFET_RD_CC2
  * @retval None
  */
void BSP_MOSFET_On(Mosfet_TypeDef Mosfet)
{
  HAL_GPIO_WritePin(MOSFET_PORT[Mosfet], MOSFET_PIN[Mosfet], GPIO_PIN_SET);
}

/**
  * @brief  Turns selected MOSFET Off.
  * @param  Mosfet Specifies the Mosfet to be set on.
  *   This parameter can be one of following parameters:
  *     @arg MOSFET_ENCC1
  *     @arg MOSFET_ENCC2
  *     @arg MOSFET_RD_CC1
  *     @arg MOSFET_RD_CC2
  * @retval None
  */
void BSP_MOSFET_Off(Mosfet_TypeDef Mosfet)
{
  HAL_GPIO_WritePin(MOSFET_PORT[Mosfet], MOSFET_PIN[Mosfet], GPIO_PIN_RESET);
}

/**
  * @brief  Configures Door Sensor in GPIO or EXTI modes.
  * @param  Door_Mode door sense mode.
  *    This parameter can be one of the following values:
  *     @arg  DOOR_MODE_GPIO: door sense pins will be used as simple IOs
  *     @arg  DOOR_MODE_EXTI: door sense pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @retval HAL_OK if all initializations are OK. Other value if error.
  */
uint8_t BSP_DOOR_Init(DOORMode_TypeDef Door_Mode)
{
  GPIO_InitTypeDef GPIO_InitStruct;

