STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G071B-Discovery/stm32g071b_discovery.c
  /* Enable GPIO clock */
  DISCOVERY_I2C1_GPIO_CLK_ENABLE();

  /* Configure I2C SCL & SDA as alternate function  */
  GPIO_InitStruct.Pin       = (DISCOVERY_I2C1_SCL_PIN| DISCOVERY_I2C1_SDA_PIN);
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = DISCOVERY_I2C1_SCL_SDA_AF;
  HAL_GPIO_Init(DISCOVERY_I2C1_GPIO_PORT, &GPIO_InitStruct);

  /*##-3- Configure the Discovery I2C peripheral #######################################*/
  /* Enable I2C clock */
  DISCOVERY_I2C1_CLK_ENABLE();

  /* Force the I2C peripheral clock reset */
  DISCOVERY_I2C1_FORCE_RESET();

  /* Release the I2C peripheral clock reset */
  DISCOVERY_I2C1_RELEASE_RESET();
}

/**
  * @brief Discovery I2C1 Bus Deitialization
  * @retval None
  */
static void I2C1_DeInit(void)
{
  /* Decrement I2C1 reference counter */
  I2C1RefCounter--;

  if (I2C1RefCounter== 0)
  {
    /* Deinit the I2C */
    HAL_I2C_DeInit(&I2c1Handle);
    I2C1_MspDeInit(&I2c1Handle);
  }
}

/**
  * @brief Discovery I2C1 MSP Deinitialization
  * @param hi2c I2C handle
  * @retval None
  */
static void I2C1_MspDeInit(I2C_HandleTypeDef *hi2c)
{
  /*##-1- Unconfigure the GPIOs ################################################*/
  HAL_GPIO_DeInit(DISCOVERY_I2C1_GPIO_PORT, (DISCOVERY_I2C1_SCL_PIN | DISCOVERY_I2C1_SDA_PIN));

  /*##-2- Unconfigure the Discovery I2C1 peripheral ############################*/
  /* Force & Release the I2C Peripheral Clock Reset */
  DISCOVERY_I2C1_FORCE_RESET();
  DISCOVERY_I2C1_RELEASE_RESET();

  /* Disable Discovery I2C1 clock */
  DISCOVERY_I2C1_CLK_DISABLE();
}

/**
  * @brief  Write a value in a register of the device through BUS.
  * @param  Addr Device address on BUS Bus.
  * @param  Reg The target register address to write
  * @param  RegSize The target register size (can be 8BIT or 16BIT)
  * @param  pBuffer The target register value to be written
  * @param  Length buffer size to be written
  * @retval None
  */
static HAL_StatusTypeDef I2C1_WriteBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length)
{
  HAL_StatusTypeDef status = HAL_OK;

  status = HAL_I2C_Mem_Write(&I2c1Handle, Addr, (uint16_t)Reg, RegSize, pBuffer, Length, I2c1Timeout);

/* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initiaize the BUS */
    I2C1_Error();
  }
  return status;
}

/**
  * @brief  Reads multiple data on the BUS.
  * @param  Addr I2C Address
  * @param  Reg Reg Address
  * @param  RegSize The target register size (can be 8BIT or 16BIT)
  * @param  pBuffer pointer to read data buffer
  * @param  Length length of the data
  * @retval 0 if no problems to read multiple data
  */
static HAL_StatusTypeDef I2C1_ReadBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length)
{
  HAL_StatusTypeDef status = HAL_OK;

  status = HAL_I2C_Mem_Read(&I2c1Handle, Addr, (uint16_t)Reg, RegSize, pBuffer, Length, I2c1Timeout);

/* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initiaize the BUS */
    I2C1_Error();
  }
  return status;
}

/**
  * @brief Discovery I2C1 error treatment function
  * @retval None
  */
static void I2C1_Error (void)
{
  /* De-initialize the I2C communication BUS */
  HAL_I2C_DeInit(&I2c1Handle);

  /* Re- Initiaize the I2C communication BUS */
  I2C1_Init();
}
#endif /*HAL_I2C_MODULE_ENABLED*/
/**
  * @}
  */

/** @addtogroup STM32G071B_DISCOVERY_LINK_Operations_Functions
  * @{
  */
/*******************************************************************************
                            LINK OPERATIONS
*******************************************************************************/
#if defined(HAL_SPI_MODULE_ENABLED)
/*********************** LINK LCD ***********************************/
/**
  * @brief  Initialize LCD IO interface.
  * @retval None
  */
void LCD_IO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Configure the LCD Chip Select pin --------------------------------------*/
  LCD_CS_GPIO_CLK_ENABLE();

  /* Configure NCS in Output Push-Pull mode */
  GPIO_InitStruct.Pin     = LCD_CS_PIN;
  GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull    = GPIO_NOPULL;
  GPIO_InitStruct.Speed   = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_CS_GPIO_PORT, &GPIO_InitStruct);

  /* Set or Reset the control line */
  LCD_CS_LOW();

  /* Configure the LCD Data/Control pin -------------------------------------*/
  LCD_DC_GPIO_CLK_ENABLE();

  /* Configure NCS in Output Push-Pull mode */
  GPIO_InitStruct.Pin     = LCD_DC_PIN;
  GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull    = GPIO_NOPULL;
  GPIO_InitStruct.Speed   = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_DC_GPIO_PORT, &GPIO_InitStruct);

  /* Set or Reset the control line */
  LCD_DC_LOW();

  /* Configure the LCD Reset pin --------------------------------------------*/
  LCD_RST_GPIO_CLK_ENABLE();

  /* Configure NCS in Output Push-Pull mode */
  GPIO_InitStruct.Pin     = LCD_RST_PIN;
  GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull    = GPIO_NOPULL;
  GPIO_InitStruct.Speed   = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_RST_GPIO_PORT, &GPIO_InitStruct);

  /* Initialized SPI Module */
  SPIx_Init();

  /* Reset LCD */
  LCD_RST_LOW();
  HAL_Delay(1);
  LCD_RST_HIGH();
}

/**
  * @brief  De-configures LCD IO interface.
  * @retval None
  */
void LCD_IO_DeInit(void)
{
  /* Set or Reset the control line */
  LCD_CS_LOW();
  
  /* Set or Reset the control line */
  LCD_DC_LOW();  
  
  /* Reset LCD */
  LCD_RST_LOW();
  HAL_Delay(1);
  LCD_RST_HIGH();

  /* Uninitialize SPI bus */
  SPIx_DeInit();

  /* Uninitialize LCD Chip Select Pin */  
  HAL_GPIO_DeInit(LCD_CS_GPIO_PORT, LCD_CS_PIN);
  /* Uninitialize LCD Data/Control Pin */  
  HAL_GPIO_DeInit(LCD_DC_GPIO_PORT, LCD_DC_PIN);
  /* Uninitialize LCD Reset Pin */  
  HAL_GPIO_DeInit(LCD_RST_GPIO_PORT, LCD_RST_PIN);
}

/**
  * @brief  Writes command on LCD register.
  * @param  Cmd Register to be written
  * @retval None
  */
void LCD_IO_WriteCommand(uint8_t Cmd)
{
  /* Reset LCD control line(/CS) and Send command */
  LCD_CS_LOW();

  LCD_DC_LOW();

  SPIx_Write(Cmd);

