STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G071B-Discovery/stm32g071b_discovery.c
  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}

/**
  * @brief  Writes one byte to the LCD
  * @param  Value  Data to be written
  * @retval None
 */
void LCD_IO_WriteData(uint8_t Value)
{
  /* Reset LCD control line(/CS) and Send command */
  LCD_CS_LOW();

  LCD_DC_HIGH();

  SPIx_Write(Value);

  LCD_DC_LOW();

  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}

/**
  * @brief  Writes multiple data to the LCD
  * @param  pData pointer to the data to be written
  * @param  Size of data to be written
  * @retval none
  */
void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
{
  uint32_t counter = 0;

  /* Reset LCD control line(/CS) and Send command */
  LCD_CS_LOW();

  LCD_DC_HIGH();

  /* disable the SPI */
  __HAL_SPI_DISABLE(&SpiHandle);

  if (Size == 1)
  {
    /* Only 1 byte to be sent to LCD - general interface can be used */
    /* Send Data */
    SPIx_Write(*pData);
  }
  else
  {
      /* Enable the SPI */
  __HAL_SPI_ENABLE(&SpiHandle);

    for (counter = Size; counter != 0; counter--)
    {
      while(((SpiHandle.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
      {
      }
      /* Need to invert bytes for LCD*/
      *((__IO uint8_t*)&SpiHandle.Instance->DR) = *(pData);

      pData ++;
    }

    /* Wait until the bus is ready before releasing Chip select */
    while(((SpiHandle.Instance->SR) & SPI_FLAG_BSY) != RESET)
    {
    }
  }

  /* disable the SPI */
  __HAL_SPI_DISABLE(&SpiHandle);

  LCD_DC_LOW();

  /* Deselect : Chip Select high */
  LCD_CS_HIGH();
}
#endif /* HAL_SPI_MODULE_ENABLED */

#if defined(HAL_I2C_MODULE_ENABLED)
/****************************** LINK POWER MONITOR *****************************/
/**
  * @brief  Initializes Power Monitor low level.
  * @retval None
  */
uint8_t PWRMON_IO_Init(uint16_t Addr)
{
  uint8_t ret;
  ret = (I2C1_Init() == HAL_OK) ? 0 : 1;
  return ret;
}

/**
  * @brief  Deinitializes Power Monitor low level.
  * @retval None
  */
void PWRMON_IO_DeInit(uint16_t Addr)
{
  I2C1_DeInit();
}

/**
  * @brief  Writes a single data.
  * @param  Addr I2C address
  * @param  Reg Reg address
  * @param  pData pointer to the data to be written
  * @retval 0 success, else failed
  */
uint8_t PWRMON_IO_Write(uint16_t Addr, uint8_t Reg, uint8_t * pData)
{
  uint8_t ret;
  ret = (I2C1_WriteBuffer(Addr, Reg, I2C_MEMADD_SIZE_8BIT, pData, sizeof(uint16_t)) == HAL_OK) ? 0 : 1;
  return ret;
}

/**
  * @brief  Reads a single data.
  * @param  Addr I2C address
  * @param  Reg Reg address
  * @param  pData pointer to the data
  * @retval 0 success, else failed
  */
uint8_t PWRMON_IO_Read(uint16_t Addr, uint8_t Reg, uint8_t *pData)
{
  uint8_t ret;
  ret = (I2C1_ReadBuffer(Addr, Reg, I2C_MEMADD_SIZE_8BIT, pData, sizeof(uint16_t)) == HAL_OK) ? 0 : 1;
  return ret;
}

/**
  * @brief  Enable ALERT Interrupt.
  * @param  Addr I2C address
  * @param  ActiveEdge active edge (0: falling - 1: Rising)
  * @retval None
  */
void PWRMON_IO_EnableIT(uint16_t Addr, uint8_t ActiveEdge)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  Alert_TypeDef     alert = ALERT_VBUS;

  if (Addr == VBUS_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_VBUS;
  }
  else if (Addr == CC1_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_CC1;
  }
  else if (Addr == CC2_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_CC2;
  }

  /* Enable the GPIO clock */
  ALERTx_GPIO_CLK_ENABLE(alert);

  /* Configure ALERT GPIO pin */
  GPIO_InitStruct.Pin   = ALERT_PIN[alert];
  GPIO_InitStruct.Pull  = GPIO_PULLUP;//GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  if (ActiveEdge == 0)
  {
    GPIO_InitStruct.Mode  = GPIO_MODE_IT_FALLING;
  }
  else
  {
    GPIO_InitStruct.Mode  = GPIO_MODE_IT_RISING;
  }
  HAL_GPIO_Init(ALERT_PORT[alert], &GPIO_InitStruct);

  /* Enable and set GPIO EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)ALERT_IRQn[alert], 0x0F, 0x0F);
  HAL_NVIC_EnableIRQ((IRQn_Type)ALERT_IRQn[alert]);
}

/**
  * @brief  Disable ALERT Interrupt.
  * @retval None
  */
void PWRMON_IO_DisableIT(uint16_t Addr)
{
  Alert_TypeDef     alert = ALERT_VBUS;

  if (Addr == VBUS_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_VBUS;
  }
  else if (Addr == CC1_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_CC1;
  }
  else if (Addr == CC2_SENSING_I2C_ADDRESS)
  {
    alert = ALERT_CC2;
  }

  HAL_GPIO_DeInit(ALERT_PORT[alert], ALERT_PIN[alert]);

  /* Do not disable GPIO EXTI Interrupt as the same EXTI line may be shared by
   * several ALERT pins.
   */
}

#endif /* HAL_I2C_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
